package by.it.hutnik.jd01;
//напишите программу которая выводит на экран
//Hello world!
//
//(строка должна быть одна, ошибки в тексте не допускаются)
public class TaskA1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
