package by.it.yemialyanava.jd01_15;
/*Класс TaskB
         В программе создайте хотя бы 5 разных комментариев: 2 однострочных, 2 многострочных и 1 JavaDoc
         Программа должна прочитать свой собственный текст в переменную типа StringBuilder.
         Читая программу необходимо удалить все возможные виды комментариев, не трогая остальное.
         Результат вывести на консоль и в файл с тем же местоположением и именем, но с расширением txt, а не java.
         Считайте, что комментарии внутри строки невозможны (s=“//так не бывает”) и внутри комментария тоже
/** bla… /*так не бывает*//* bla… //и так тоже bla… */ /*. Регулярные выражения использовать нельзя*/

public class TaskB {
    public static void main(String[] args) {

    }
}
